## Label encoding and One hot encoding (:CATEGORIAL ENCODING)

## Label encoding

In [152]:
import pandas as pd

data = pd.DataFrame({
    'country': ['India','UK','Japan','UK','Japan'],
    'age': [44, 34, 46, 35, 23],
    'salary': [72000,65000,98000,45000,34000]
})

data

  country  age  salary
0   India   44   72000
1      UK   34   65000
2   Japan   46   98000
3      UK   35   45000
4   Japan   23   34000

In [154]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
data['country'] = label_encoder.fit_transform(data['country'])
data

   country  age  salary
0        0   44   72000
1        2   34   65000
2        1   46   98000
3        2   35   45000
4        1   23   34000

In [155]:
label_encoder.classes_

array(['India', 'Japan', 'UK'], dtype=object)

## One hot encoding

In [216]:
import pandas as pd

data = pd.DataFrame({
    'country': ['India','UK','Japan','UK','Japan'],
    'age': [44, 34, 46, 35, 23],
    'salary': [72000,65000,98000,45000,34000]
})

data

  country  age  salary
0   India   44   72000
1      UK   34   65000
2   Japan   46   98000
3      UK   35   45000
4   Japan   23   34000

In [217]:
X = data['country'].values.reshape(-1,1)
X

array([['India'],
       ['UK'],
       ['Japan'],
       ['UK'],
       ['Japan']], dtype=object)

In [218]:
from sklearn.preprocessing import OneHotEncoder

onehot_encoder = OneHotEncoder()
X = onehot_encoder.fit_transform(X).toarray()
X

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.]])

In [219]:
X.shape[1]

3

In [220]:
onehot_encoder.categories_

[array(['India', 'Japan', 'UK'], dtype=object)]

In [221]:
data_onehot = pd.DataFrame(X, columns = [str(i) for i in range(X.shape[1])])
data_onehot

     0    1    2
0  1.0  0.0  0.0
1  0.0  0.0  1.0
2  0.0  1.0  0.0
3  0.0  0.0  1.0
4  0.0  1.0  0.0

In [222]:
data = pd.concat([data_onehot, data], axis = 1)
data

     0    1    2 country  age  salary
0  1.0  0.0  0.0   India   44   72000
1  0.0  0.0  1.0      UK   34   65000
2  0.0  1.0  0.0   Japan   46   98000
3  0.0  0.0  1.0      UK   35   45000
4  0.0  1.0  0.0   Japan   23   34000

In [224]:
data = data.drop(['country'], axis = 1)
data

     0    1    2  age  salary
0  1.0  0.0  0.0   44   72000
1  0.0  0.0  1.0   34   65000
2  0.0  1.0  0.0   46   98000
3  0.0  0.0  1.0   35   45000
4  0.0  1.0  0.0   23   34000

##### One hot encoding ->
Categorical value : Nominal

Categorial is not to much
 
##### Label encoding ->
Categorical value : Ordinal
 
Categorial is much